fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	   	
	ЗарплатнаяВедомость =  Выплаты.Выгрузить();
	ЗарплатнаяВедомость.Свернуть("Сотрудник","Сумма"); 
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками Приход
	Для Каждого ТекСтрокаВыплаты Из ЗарплатнаяВедомость Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник) КАК Сотрудник,
			|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Переплата
			|ИЗ
			|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Граница, Сотрудник В
			|		(ВЫБРАТЬ
			|			ВКМ_ВыплатаЗарплатыВыплаты.Сотрудник КАК Сотрудник
			|		ИЗ
			|			Документ.ВКМ_ВыплатаЗарплаты.Выплаты КАК ВКМ_ВыплатаЗарплатыВыплаты
			|		ГДЕ
			|			ВКМ_ВыплатаЗарплатыВыплаты.Ссылка = &Ссылка)) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
			|ГДЕ
			|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток < 0";
	
		
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрШаблон("Операция не возможна. По сотруднику %1 сумма к выдаче превышает сумму начисления на %2 руб.", Выборка.Сотрудник, - Выборка.Переплата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
  Если ОбменДанными.Загрузка Тогда
     Возврат;
 КонецЕсли;
 
 Если ИмеютсяПроведенныеДокументыСозданныеПослеТекущего() Тогда
	 
	 ТекстСообщения = "Нарушается последовательность проведения документов.
	 					|Имеются более поздние проведенные документы ВыплатаЗарплаты.
	 					|Для записи этого документа отмените проведения всех последующих и повторите попытку записи.";
	 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	 
 КонецЕсли;
 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ИмеютсяПроведенныеДокументыСозданныеПослеТекущего()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВыплатаЗарплаты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ВыплатаЗарплаты КАК ВКМ_ВыплатаЗарплаты
		|ГДЕ
		|	ВКМ_ВыплатаЗарплаты.Дата >= &ДатаДокумента
		|	И ВКМ_ВыплатаЗарплаты.Ссылка <> &Ссылка
		|	И ВКМ_ВыплатаЗарплаты.Проведен";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
